AcDbVertexRef.ImpliedType
An implied vertex ref is a special point on another AcDbGeomRef.
Currently we only have implied vertex ref types for the most common case of
special points on an AcDbEdgeRef. I am not sure if we should keep extending this
mechanism in the future. Other mechanisms, such as derivation from AcDbVertexRef,
should be used for more specialized and/or less common cases.